[
  {
    "name": "BPC-157/TB-500",
    "filename": "bpc-157-tb-500.html",
    "category": "Tissue Repair",
    "categoryColor": "#059669",
    "price": 40,
    "quantity": "10mg/10mg",
    "form": "Lyophilized Powder (Dual Blend)",
    "purity": "≥98% (per component)",
    "cas": "137525-51-0 (BPC-157)",
    "mw": "1419.5 g/mol (BPC-157)",
    "formula": "C<sub>62</sub>H<sub>98</sub>N<sub>16</sub>O<sub>22</sub> (BPC-157)",
    "shortDesc": "Dual tissue repair complex pairing cytoprotective and actin-mediated cell migration mechanisms.",
    "fullDesc": "Tissue repair requires coordinated processes: inflammatory resolution, angiogenesis, cell migration, extracellular matrix remodeling, and cytoprotection. This combination targets multiple phases simultaneously. BPC-157 demonstrates remarkable cytoprotective properties while promoting angiogenesis through VEGF modulation. TB-500 facilitates actin polymerization and cytoskeletal reorganization, driving cell migration to injury sites.\n\nTheir mechanisms complement: BPC-157 protects existing tissue and stimulates new vessel formation, while TB-500 mobilizes repair cells and promotes structural regeneration. With hundreds of published studies investigating each peptide individually, researchers increasingly combine them to model multi-phase tissue healing—from acute injury response through complete structural restoration.",
    "applications": ["Wound healing models", "Angiogenesis research", "Cytoprotection mechanisms", "Cell migration assays", "Collagen synthesis studies", "Anti-inflammatory pathway research"],
    "storage": "Store lyophilized at -20°C protected from moisture. Both peptides remain stable when co-reconstituted; maintain at 2-8°C and use within 30 days. Compatible in the same solution without interaction.",
    "related": [
      { "name": "GHK-Cu 100mg", "filename": "ghk-cu-100mg.html", "category": "Tissue Repair", "price": 31 },
      { "name": "KPV 10mg", "filename": "kpv-10mg.html", "category": "Tissue Repair", "price": 36 },
      { "name": "LL-37 5mg", "filename": "ll-37-5mg.html", "category": "Tissue Repair", "price": 29 }
    ],
    "injectable": true
  },
  {
    "name": "KPV 10mg",
    "filename": "kpv-10mg.html",
    "category": "Tissue Repair",
    "categoryColor": "#059669",
    "price": 36,
    "quantity": "10mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "61090-95-7",
    "mw": "342.4 g/mol",
    "formula": "C<sub>16</sub>H<sub>30</sub>N<sub>4</sub>O<sub>4</sub>",
    "shortDesc": "Anti-inflammatory tripeptide from α-MSH that retains NF-κB inhibition without melanocortin activation.",
    "fullDesc": "KPV (Lysine-Proline-Valine) represents molecular dissection of anti-inflammatory signaling. As the C-terminal tripeptide of alpha-melanocyte stimulating hormone, KPV retains the parent molecule's remarkable anti-inflammatory properties while eliminating melanocortin receptor-mediated effects like pigmentation. This separation of functions makes KPV uniquely valuable for inflammatory research.\n\nResearch has demonstrated KPV's effectiveness in inflammatory bowel disease models, dermal inflammation studies, and wound healing research where inflammation must be controlled without suppressing the entire immune response. Its ability to penetrate epithelial barriers and concentrate in inflamed tissues makes it particularly relevant for mucosal inflammation research.",
    "applications": ["NF-κB signaling inhibition", "Inflammatory cytokine modulation", "Inflammatory bowel disease models", "Mucosal immunity research", "Wound healing inflammation control", "Melanocortin peptide fragment studies"],
    "storage": "Store lyophilized at -20°C. Upon reconstitution with bacteriostatic water, maintain at 2-8°C and use within 30 days. This small peptide demonstrates excellent stability in solution.",
    "related": [
      { "name": "BPC-157/TB-500", "filename": "bpc-157-tb-500.html", "category": "Tissue Repair", "price": 40 },
      { "name": "LL-37 5mg", "filename": "ll-37-5mg.html", "category": "Tissue Repair", "price": 29 },
      { "name": "Thymalin 10mg", "filename": "thymalin-10mg.html", "category": "Tissue Repair", "price": 37 }
    ],
    "injectable": true
  },
  {
    "name": "Sermorelin 5mg",
    "filename": "sermorelin-5mg.html",
    "category": "Growth Hormone",
    "categoryColor": "#EA580C",
    "price": 38,
    "quantity": "5mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "86168-78-7",
    "mw": "3357.9 g/mol",
    "formula": "C<sub>149</sub>H<sub>246</sub>N<sub>44</sub>O<sub>42</sub>S",
    "shortDesc": "GHRH(1-29) fragment retaining complete growth hormone releasing activity.",
    "fullDesc": "Sermorelin represents elegant peptide design: by identifying the minimal bioactive sequence within full-length GHRH(1-44), researchers created a compound with identical receptor activity but enhanced stability and reduced immunogenicity. This 29-amino acid fragment contains the entire receptor-binding domain, making it indispensable for studying GHRH receptor pharmacology without the complications of the full 44-residue hormone.\n\nThe peptide binds selectively to GHRH receptors on pituitary somatotrophs, triggering endogenous growth hormone release through natural pulsatile mechanisms. Unlike exogenous growth hormone administration, sermorelin preserves the physiological feedback loops governing GH secretion, making it the preferred tool for studying growth hormone axis regulation and pituitary function.",
    "applications": ["GHRH receptor binding studies", "Pituitary somatotroph function", "Growth hormone secretion dynamics", "Pulsatile GH release mechanisms", "IGF-1 pathway research", "Growth hormone axis physiology"],
    "storage": "Store lyophilized at -20°C protected from light. Reconstitute with bacteriostatic water; maintain at 2-8°C and use within 30 days. The truncated structure provides improved stability versus full-length GHRH.",
    "related": [
      { "name": "Ipamorelin 5mg", "filename": "ipamorelin-5mg.html", "category": "Growth Hormone", "price": 21 },
      { "name": "CJC-1295/Ipamorelin", "filename": "cjc-1295-ipamorelin.html", "category": "Growth Hormone", "price": 42 },
      { "name": "HGH 191", "filename": "hgh-191.html", "category": "Growth Hormone", "price": 28 }
    ],
    "injectable": true
  },
  {
    "name": "Ipamorelin 5mg",
    "filename": "ipamorelin-5mg.html",
    "category": "Growth Hormone",
    "categoryColor": "#EA580C",
    "price": 21,
    "quantity": "5mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "170851-70-4",
    "mw": "711.9 g/mol",
    "formula": "C<sub>38</sub>H<sub>49</sub>N<sub>9</sub>O<sub>5</sub>",
    "shortDesc": "Most selective growth hormone secretagogue with exceptional GH specificity.",
    "fullDesc": "Ipamorelin solved a critical problem in growth hormone secretagogue research: earlier ghrelin mimetics stimulated GH release but also elevated prolactin and cortisol through off-target receptor activation. This pentapeptide demonstrates near-exclusive selectivity for the ghrelin receptor (GHS-R1a) on somatotrophs, triggering GH secretion without hormonal side effects that confound experimental interpretation.\n\nThis selectivity makes ipamorelin the gold standard for dissecting ghrelin receptor pharmacology and GH secretion mechanisms. Researchers studying the distinction between GHRH-mediated and ghrelin-mediated GH release, or investigating selective GH secretagogue approaches, find this peptide essential for clean, interpretable results.",
    "applications": ["Ghrelin receptor (GHS-R1a) pharmacology", "Selective GH secretion mechanisms", "Growth hormone pulse dynamics", "Somatotroph receptor selectivity", "GHRP comparative studies", "Non-GHRH secretagogue pathways"],
    "storage": "Store lyophilized at -20°C. Upon reconstitution with bacteriostatic water, refrigerate at 2-8°C and utilize within 30 days. Ipamorelin demonstrates excellent stability in solution compared to earlier secretagogues.",
    "related": [
      { "name": "CJC-1295 (no DAC)", "filename": "cjc-1295-no-dac.html", "category": "Growth Hormone", "price": 42 },
      { "name": "Sermorelin 5mg", "filename": "sermorelin-5mg.html", "category": "Growth Hormone", "price": 38 },
      { "name": "CJC-1295/Ipamorelin", "filename": "cjc-1295-ipamorelin.html", "category": "Growth Hormone", "price": 42 }
    ],
    "injectable": true
  },
  {
    "name": "NAD+ 1000mg",
    "filename": "nad-1000mg.html",
    "category": "Antioxidants",
    "categoryColor": "#7C3AED",
    "price": 30,
    "quantity": "1000mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "53-84-9",
    "mw": "663.4 g/mol",
    "formula": "C<sub>21</sub>H<sub>27</sub>N<sub>7</sub>O<sub>14</sub>P<sub>2</sub>",
    "shortDesc": "High-dose cellular cofactor for energy metabolism, DNA repair, and cellular signaling.",
    "fullDesc": "Nicotinamide adenine dinucleotide occupies a position of unparalleled importance in cellular biochemistry. This dinucleotide serves simultaneously as an electron carrier in redox reactions, a substrate for sirtuins, a substrate for PARPs (DNA repair enzymes), and a precursor for calcium signaling molecules. NAD+ levels decline with age across tissues, correlating with metabolic dysfunction and cellular senescence.\n\nWithout adequate NAD+, cellular energy production, gene expression regulation, and DNA maintenance all collapse. Studies investigating sirtuins, researching cellular energy metabolism, exploring DNA repair mechanisms, or modeling age-related NAD+ decline require direct NAD+ administration or measurement.",
    "applications": ["Redox biochemistry", "Sirtuin activation research", "Cellular energy metabolism", "PARP enzyme function", "Mitochondrial studies", "NAD+/NADH ratio measurement"],
    "storage": "Store lyophilized at -20°C protected from light (NAD+ is photosensitive). Upon reconstitution with sterile water, use immediately or store at 2-8°C for up to 30 days. Avoid repeated freeze-thaw cycles which degrade the dinucleotide.",
    "related": [
      { "name": "SS-31 (Elamipretide)", "filename": "ss-31-10mg.html", "category": "Antioxidants", "price": 55 },
      { "name": "Glutathione 1500mg", "filename": "glutathione-1500mg.html", "category": "Antioxidants", "price": 38 },
      { "name": "MOTS-c 10mg", "filename": "mots-c-10mg.html", "category": "Metabolic", "price": 28 }
    ],
    "injectable": false
  },
  {
    "name": "AOD-9604 2mg",
    "filename": "aod-9604-2mg.html",
    "category": "Metabolic",
    "categoryColor": "#DC2626",
    "price": 20,
    "quantity": "2mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "221231-10-3",
    "mw": "1815.1 g/mol",
    "formula": "C<sub>78</sub>H<sub>123</sub>N<sub>23</sub>O<sub>23</sub>S<sub>2</sub>",
    "shortDesc": "Modified growth hormone fragment retaining lipolytic activity without GH receptor activation.",
    "fullDesc": "AOD-9604 represents molecular surgery on growth hormone. Australian researchers at Monash University identified the 176-191 C-terminal region as responsible for GH's lipolytic effects, then added stabilizing modifications to create a fragment that stimulates lipolysis without growth hormone receptor binding. The result: fat-mobilizing properties without effects on growth, glucose metabolism, or IGF-1—a clean separation impossible with full-length GH.\n\nThis selective action makes AOD-9604 invaluable for dissecting GH's metabolic effects. Researchers can investigate lipolytic signaling mechanisms, study adipocyte beta-oxidation, and explore growth hormone's metabolic functions without the confounding variables of receptor-mediated GH actions.",
    "applications": ["Lipolysis mechanism research", "GH fragment biology", "Lipid metabolism studies", "Adipocyte signaling independent of GH receptor", "Selective metabolic pathway activation", "Non-receptor GH effects"],
    "storage": "Store lyophilized at -20°C. Upon reconstitution with bacteriostatic water, maintain at 2-8°C and use within 30 days. The modifications provide enhanced stability compared to unmodified HGH fragments.",
    "related": [
      { "name": "MOTS-c 10mg", "filename": "mots-c-10mg.html", "category": "Metabolic", "price": 28 },
      { "name": "L-Carnitine 600mg", "filename": "l-carnitine-600mg.html", "category": "Metabolic", "price": 26 },
      { "name": "Lipo-C MAX Blend", "filename": "lipo-c-max.html", "category": "Metabolic", "price": 42 }
    ],
    "injectable": true
  },
  {
    "name": "MOTS-c 10mg",
    "filename": "mots-c-10mg.html",
    "category": "Metabolic",
    "categoryColor": "#DC2626",
    "price": 28,
    "quantity": "10mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "1627580-64-6",
    "mw": "2174.6 g/mol",
    "formula": "C<sub>101</sub>H<sub>152</sub>N<sub>28</sub>O<sub>22</sub>S<sub>2</sub>",
    "shortDesc": "Mitochondrial genome-encoded peptide that translocates to nucleus to regulate metabolism.",
    "fullDesc": "MOTS-c represents a paradigm shift in cellular biology. Discovered in 2015, this peptide revealed that the mitochondrial genome contains open reading frames for signaling peptides that regulate nuclear gene expression. MOTS-c, encoded within the mitochondrial 12S rRNA gene, acts as a mitochondrial-to-nuclear messenger: during metabolic stress, it translocates to the nucleus and modulates gene expression involved in glucose metabolism and insulin sensitivity.\n\nThis mitochondrial-nuclear communication pathway challenges traditional views of metabolic regulation. MOTS-c activates AMPK, enhances glucose uptake, and improves metabolic flexibility—effects that position it at the intersection of aging research, metabolic disease modeling, and the study of retrograde signaling from mitochondria to nucleus.",
    "applications": ["Mitochondrial-nuclear signaling", "Metabolic homeostasis mechanisms", "AMPK pathway research", "Insulin sensitivity studies", "Mitochondrial genome function", "Retrograde signaling research"],
    "storage": "Store lyophilized at -20°C protected from moisture. Reconstitute with bacteriostatic water; stable at 2-8°C for 30 days. Handle as a standard peptide despite its mitochondrial origin.",
    "related": [
      { "name": "SS-31 (Elamipretide)", "filename": "ss-31-10mg.html", "category": "Antioxidants", "price": 55 },
      { "name": "NAD+ 1000mg", "filename": "nad-1000mg.html", "category": "Antioxidants", "price": 30 },
      { "name": "L-Carnitine 600mg", "filename": "l-carnitine-600mg.html", "category": "Metabolic", "price": 26 }
    ],
    "injectable": true
  },
  {
    "name": "5-Amino-1MQ 5mg",
    "filename": "5-amino-1mq-5mg.html",
    "category": "Metabolic",
    "categoryColor": "#DC2626",
    "price": 25,
    "quantity": "5mg",
    "form": "Powder (Oral Small Molecule)",
    "purity": "≥98%",
    "cas": "42464-96-0",
    "mw": "159.2 g/mol",
    "formula": "C<sub>10</sub>H<sub>11</sub>N<sub>2</sub><sup>+</sup>",
    "shortDesc": "Small molecule NNMT inhibitor increasing cellular NAD+ availability through enzymatic blockade.",
    "fullDesc": "5-Amino-1-methylquinolinium targets a metabolic bottleneck: nicotinamide N-methyltransferase (NNMT), an enzyme that consumes NAD+ precursors by methylating nicotinamide for excretion. By inhibiting NNMT, 5-Amino-1MQ preserves intracellular nicotinamide, allowing its recycling back to NAD+ through the salvage pathway. This mechanism provides an alternative approach to NAD+ augmentation—rather than supplying more precursor, block the pathway that depletes it.\n\nNNMT overexpression correlates with metabolic dysfunction and adiposity in preclinical models, suggesting this enzyme represents a metabolic control point. Note: This is an oral small molecule, not an injectable peptide.",
    "applications": ["NNMT enzyme inhibition research", "NAD+ salvage pathway studies", "Cellular methylation research", "Metabolic regulation mechanisms", "Adipocyte metabolism studies"],
    "storage": "Store at room temperature (15-30°C) in sealed container protected from moisture. This small molecule exhibits excellent stability. For research use, dissolve in appropriate vehicle according to experimental protocol.",
    "related": [
      { "name": "NAD+ 1000mg", "filename": "nad-1000mg.html", "category": "Antioxidants", "price": 30 },
      { "name": "MOTS-c 10mg", "filename": "mots-c-10mg.html", "category": "Metabolic", "price": 28 },
      { "name": "AOD-9604 2mg", "filename": "aod-9604-2mg.html", "category": "Metabolic", "price": 20 }
    ],
    "injectable": false
  },
  {
    "name": "Selank 5mg",
    "filename": "selank-5mg.html",
    "category": "Neuropeptides",
    "categoryColor": "#0891B2",
    "price": 36,
    "quantity": "5mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "129954-34-3",
    "mw": "751.9 g/mol",
    "formula": "C<sub>33</sub>H<sub>57</sub>N<sub>11</sub>O<sub>9</sub>",
    "shortDesc": "Synthetic anxiolytic peptide with cytokine-modulating activity for neurochemical research.",
    "fullDesc": "Developed at Moscow's Institute of Molecular Genetics, Selank represents a rational design approach to neuropeptide therapeutics—a synthetic heptapeptide built upon the immune peptide tuftsin's structural scaffold. This derivative demonstrates the rare capacity to simultaneously modulate IL-6 expression and influence monoaminergic neurotransmitter systems, bridging neuroimmune signaling in ways few compounds can.\n\nResearchers investigating the intersection of immune signaling and behavioral neuroscience find Selank indispensable. Over two decades of Russian neurochemical research have characterized its mechanism across multiple systems, making it one of the most comprehensively studied synthetic anxiolytics in contemporary neuropharmacology.",
    "applications": ["Anxiety model studies", "Cognitive function research", "Immune-neuro axis modulation", "GABAergic pathway studies", "Stress response mechanisms", "Cytokine regulation research"],
    "storage": "Store lyophilized at -20°C in sealed vial. Upon reconstitution with bacteriostatic water, maintain at 2-8°C and utilize within 30 days. Avoid freeze-thaw cycles to preserve peptide integrity.",
    "related": [
      { "name": "Semax 5mg", "filename": "semax-5mg.html", "category": "Neuropeptides", "price": 31 },
      { "name": "Cerebrolysin 60mg", "filename": "cerebrolysin-60mg.html", "category": "Neuropeptides", "price": 23 },
      { "name": "DSIP Night Blend", "filename": "dsip-night-blend.html", "category": "Neuropeptides", "price": 42 }
    ],
    "injectable": true
  },
  {
    "name": "Epithalon 50mg",
    "filename": "epithalon-50mg.html",
    "category": "Longevity",
    "categoryColor": "#B45309",
    "price": 66,
    "quantity": "50mg",
    "form": "Lyophilized Powder",
    "purity": "≥98%",
    "cas": "307297-39-8",
    "mw": "390.3 g/mol",
    "formula": "C<sub>14</sub>H<sub>22</sub>N<sub>4</sub>O<sub>9</sub>",
    "shortDesc": "Synthetic tetrapeptide demonstrating telomerase activation and circadian regulation in aging research.",
    "fullDesc": "Epithalon emerged from decades of Russian gerontology research. This tetrapeptide, designed to replicate bioactive sequences from the pineal peptide epithalamin, demonstrates two remarkable properties: activation of telomerase (the enzyme that maintains telomere length) and modulation of circadian rhythms through melatonin regulation. These dual mechanisms position Epithalon at the intersection of cellular aging and chronobiology research.\n\nTelomeres—the protective caps on chromosome ends—shorten with each cell division, eventually triggering senescence. Telomerase can extend telomeres, but most somatic cells suppress this enzyme. Epithalon's apparent ability to transiently activate telomerase in adult tissues has driven extensive research into its mechanism and potential for studying telomere biology.",
    "applications": ["Telomerase activity research", "Telomere biology", "Circadian rhythm regulation", "Pineal peptide research", "Cellular aging mechanisms", "Melatonin regulation studies"],
    "storage": "Store lyophilized at -20°C. Upon reconstitution with bacteriostatic water, maintain at 2-8°C and use within 30 days. This short peptide demonstrates good stability in solution.",
    "related": [
      { "name": "FOXO4-DRI 10mg", "filename": "foxo4-dri-10mg.html", "category": "Longevity", "price": 67 },
      { "name": "Thymalin 10mg", "filename": "thymalin-10mg.html", "category": "Tissue Repair", "price": 37 },
      { "name": "NAD+ 1000mg", "filename": "nad-1000mg.html", "category": "Antioxidants", "price": 30 }
    ],
    "injectable": true
  }
]